package hw10.app;


/*
Створіть Java програму з використанням методів, яка виконує наступні завдання:
Напишіть метод, який приймає ціле число як аргумент і виводить його квадрат.
Напишіть метод, який приймає два аргументи типу double - радіус та висоту - і повертає об'єм циліндра. Виведіть об'єм циліндра на екран.
Напишіть метод, який приймає масив цілих чисел та обчислює і повертає суму всіх елементів масиву.
Напишіть метод, який приймає рядок (String) як аргумент та повертає новий рядок, який складається з букв цього рядка у зворотньому порядку.
Напишіть метод, який приймає два цілих числа, a та b, і повертає результат a^b (a підняте до степеня b).
Напишіть метод, який приймає параметри: ціле число n і рядок text. Метод повинен вивести текстовий рядок text n рази, розділяючи кожен рядок символом переносу.
Залийте виконаний проект на свій GitHub репозиторій, посилання на який зазначте в LMS.
Приклад:
1. Введіть ціле число: 5
  Квадрат числа 5 дорівнює 25.
2. Об'єм циліндра з радіусом 3.5 і висотою 10.0 дорівнює 384.81334713945307.
3. Масив чисел: [10, 20, 30, 40, 50]
  Сума всіх елементів масиву дорівнює 150.
4. Введіть рядок: Hello, World!
  Рядок в зворотньому порядку: !dlroW ,olleH
5. Введіть a: 2
  Введіть b: 3
  Результат 2^3 дорівнює 8.
6. Введіть ціле число n: 4
  Введіть текстовий рядок: Java програмування
  Java програмування
  Java програмування
  Java програмування
  Java програмування
 */


public class Main {
    private Run run;

    public static void main(String[] args) {
        Run.run();
    }
}
