package hw15.app;

import hw15.model.Day;
import hw15.service.Advice;

/***
 * Створити порожній проект в IntelliJ
 * Напишемо програму, яка видає пораду/рекомендацію в залежності від днів тижня.
 * Створити enum Day, який матиме константи для кожного дня - з понеділка по неділю.
 * Створити інтерфейс, який матиме один метод - advise. На вхід метод приймає день тижня (Day).
 * Використати switch в реалізції методу, щоб мати можливість перевіряти день та видавати рекомендації наступним чином:
 * якщо це будній день з понеділка по четвер включно, друкувати в консоль пораду, як бути продуктивним на роботі
 * якщо це п'ятниця, друкуємо в консоль "Happy Friday!"
 * якщо це вихідні, то надрукувати в консоль, які місця ви б порекомендували відвідати
 * Залийте виконаний проект на свій GitHub репозиторій, посилання на який зазначте в LMS.
 */

public class Main{

    public static void main(String[] args) {
        Day.MONDAY.advice();
        Day.FRIDAY.advice();
        Day.SATURDAY.advice();
    }
}
